[
  "Ashley was amazing! He removed my EV charger from my old house and came back at reinstalled at my new house. He even helped climbed on my roof to move some garden furniture over a one storey extension for me😂would highly recommend and wouldn’t use anybody else now for any electrical work, lovely guy! Thank you!",
  "Lovely young bloke. Told us exactly what he would do and got on with the job. One hundred percent trustworthy.",
  "Ashley was great. Did a really good job. Was early and friendly. Fitted a ceiling light and dimmer switch and put in a new light bulb fitting for me. Left everything tidy and I couldnt be happoer with his work. Definitely recommend and will go to him in future",
  "Ashley added new sockets, updated light switches and moved a ceiling light. Good job, not over priced. Very friendly. Would recommend",
  "Excellent experience from start to finish, great communication and punctuality, Ashley and his team were very friendly and professional would highly recommend them",
  "Ashely turned up on time, was very knowledgeable and completed the job quickly and too a high standard. I asked him a lot of questions and he happily answered them all giving me some good advice. I would definitely use him again and recommend him to anybody. Definitely a 5-star service.",
  "Ashley was amazing! He removed my EV charger from my old house and came back at reinstalled at my new house. He even helped climbed on my roof to move some garden furniture over a one storey extension for me😂would highly recommend and wouldn’t use anybody else now for any electrical work, lovely guy! Thank you!",
  "Lovely young bloke. Told us exactly what he would do and got on with the job. One hundred percent trustworthy.",
  "Ashley was great. Did a really good job. Was early and friendly. Fitted a ceiling light and dimmer switch and put in a new light bulb fitting for me. Left everything tidy and I couldnt be happoer with his work. Definitely recommend and will go to him in future",
  "Ashley added new sockets, updated light switches and moved a ceiling light. Good job, not over priced. Very friendly. Would recommend",
  "Excellent experience from start to finish, great communication and punctuality, Ashley and his team were very friendly and professional would highly recommend them",
  "Ashely turned up on time, was very knowledgeable and completed the job quickly and too a high standard. I asked him a lot of questions and he happily answered them all giving me some good advice. I would definitely use him again and recommend him to anybody. Definitely a 5-star service.",
  "Ashley was very knowledgeable polite and helpful. his workmanship was second to none i would definitely recommend him. excellent work.",
  "Excellent friendly informed advice, very tidy work and great value Would recommend Ashley to anyone considering a new solar installation",
  "We had a previous short on our shower unit that burnt out the wiring and melted some of the cover. This meant we needed to get someone in to fit a new cable and shower system. Ashley from renegade electrical thankfully quoted for the job with a good price and availability. Ashley was knowledgeable and courteous including checking some details to make sure the job was done and there was no hold ups. He did the job well and checked the system was working well and we were happy with the job. I would definitely recommend Ashley if we need any other electrical work done.",
  "They are extremely efficient courteous, and cannot do enough to help,",
  "Within 20 minutes of submitting my job through checkatrade, Ashley had rang me, understood what was required and had booked me in for the following day. He showed up on time and completed the job to a high standard. He even made recommendations for future work to make our homes wiring safer. Will definitely be using Ashley again when the time comes.",
  "Very happy with work done and help given. Thanks.",
  "Ashley did an excellent job installing the solar panels on my roof, the batteries next to my driveway, and the ground-mounted solar setup in my garden. As someone who likes everything to be perfect, I can say he did it exactly how I would have done it (if I had the experience). I highly recommend him to anyone interested in installing solar panels and battery storage.",
  "Ashley fitted an external plug socket for me. He sourced the socket at a good price and quality of the workmanship was great. He communicated well and provided an excellent service.",
  "Initial interactions were good and on first meeting for site survey, Ashley was friendly and polite. It soon became obvious of his limitations in energy storage setups. Despite his limitations he was very keen to take on the project and because of this I decided to offer him the job and agreed do the leg work by getting him all relevant information to make things easier. Having done the legwork Ashley then pulled out without any explanations beside that it’s best to look for somebody else to do the job and then blocked me from making any further contact. Very unprofessional and discourteous",
  "We found Ashley to be a thoroughly competent and effecient electrician. He was a pleasure to deal with and went out of his way to ensure we were kept informed of all that was happening during the replacement process. We can without hesitation recommend him to anyone and we will most certainly use hin again in the future.",
  "Excellent work, on time and did what he said was needed. Wouldn’t go with anyone else. Top work",
  "Fantastic communication, fantastic workmanship and a genuinely nice chap. Would not hesitate to recommend and will be using again.",
  "We first hired Ashley for a second opinion on a whole house rewire, which another electrician convinced us we needed. After inspecting, he let us know that it was fully unnecessary and that we just needed a new fuse board. He saved us thousands of pounds with that first visit and he immediately became our go-to electrician. Since then Ashley has fitted solar panels and a battery, a doorbell, new light sockets, outdoor lighting & power, a bathroom extractor fan, removed old ariels, and probably more stuff I can't remember. I can't fault him at all and have recommended him to my friends.",
  "Ashley got in touch quickly and was patient when I wasn’t available to discuss the job initially. Talked it through, came and sized it up and completed the initial job and a few others within days. Would recommend highly and would definitely use again.",
  "Super friendly, very efficient and very well priced for the job in hand. There was an issue with the existing wiring in the property, but he went above and beyond to ensure the work was safe, and gave me detailed advice on next steps. Wonderful experience for a first time homeowner like myself - can highly recommend!",
  "We contacted Ashley due to a fault with our kitchen lights. He came to the house and fixed the problem straight away. He was friendly and very polite. We would definitely recommend him",
  "Ashley came out at short notice to do a electrical safety check on my new property, put in a bathroom extractor fan and has also fitted new light fittings and plug sockets throughout. Absolutely brilliant job, cannot recommend enough!",
  "Ashley was super responsive and did an amazing job, will definitely use his services again in the future.",
  "Ashley was friendly, knowledgeable and did a great job. He ensured that our new GivEnergy charger was properly integrated with the solar and battery system. During the job he found an earthing fault from previous work - and fixed this small job at no extra cost. He took pride in his work and charged a fair price. We'd be happy to have him back next time we need a sparky.",
  "Ashley fitted an EV charger for me and provided lots of brilliant advice prior to doing so, as I was clueless on the whole thing. His advice even allowed me to keep costs down and his prices were the best quotes I had, with nothing reduced on the quality of his work. An extremely tidy, friendly and reliable tradesman who will not rip you off! All quotes and works were completed within days of contacting him - highly recommend !",
  "Ashley arrived today to fit a new shower switch and I couldn’t have asked for better knowledge and service. Work completed to an exceptional standard and an excellent friendly personality, I would have no hesitation in recommending him to anyone",
  "Ashley fitted me a car charger great price, really professional job would highly recommend",
  "We needed the Solar Panels removing and refitting to allow roofers to replace roof. I Posted on CHECKATRADE and received a call from a very kowledgeable gentleman From RENEGADE ELECTRIC. He said he would need to see the job to enable him to work out a job plan and price. The job required working with a team RENEGADE hadnt met before. He came the next day and spent quite some time looking at the job. He left promising to call that pm with a price. RENEGADES was half of quotes from other trades had been. RENÈGADES work rate, ethic and quality. Were excellent. Will reccommend. Thank You",
  "Ashleigh gave me a prompt quote and kept to it. He was very friendly and professional. He did a good job. We’re really pleased and would happily recommend him.",
  "Absolutely first class brilliant person wonderful job done",
  "Friendly and chatty, job completed efficiently. Phoned ahead of visit to let us know he was running late - which is why I rated 10 for reliability and timekeeping as he had informed us he would be a tad late.",
  "Ashley was very professional on time, great price and excellent work would recommend",
  "The company is very good at communication and turned up promptly on the agreed date. Work carried out as agreed with efficiency and very tidy.",
  "This is the 2nd time Ashley had completed a job for us. 2 ceiling lights and two security lights. Ashley was lovely and we are happy would definitely recommend",
  "Ashley gave us a very competitive quote, and complete the work to a very high standard. Great guy as well. Highly recommend",
  "He was a through and through professional. Knew all the different wire types and how to best work around moving sockets and removing old wiring. Was courteous and patient, even with my on the fly extra requests. Will be reaching out in future for any electrical jobs needed.",
  "Extremely helpful and friendly service. The issue was resolved very quickly. I would recommend Renegade Electrical to anyone looking for an electrician and would definitely use them again in the future.",
  "Great job clean and tidy very knowledgeable",
  "Ashley has been a pleasure to meet, he’s been professional from the start and communicative also. Any issues that may have propped up I was made aware straight away, very clean job minimal damage to walls when installing new sockets and upgrading the singles to doubles, much appreciated and will keep him in my contacts for future work.",
  "All work carried out professionally, cleanly and timely. Provided certificates and guarantee. Ashley is also well mannered and a really nice guy. Highly recommend.",
  "Great service",
  "Ash was a lovely guy. Came and gave me a quote and advice what socket we needed for the outside garden. He supplied and fitted. Very nice gentleman. I highly recommend him. And I will saving his number for future electric jobs .",
  "Very professional and efficient really helpful will definitely use for future electrical work",
  "The work was done to a really good standard, came to quote really quickly, communication throughout was fab. Great work done for a really fair price. Would use again and would recommend.",
  "Ashley was very efficient and professional. Great price and would highly recommend",
  "Ash is a great person to deal with reliable good communication, friendly and good workmanship, wouldn’t hesitate to recommend him",
  "Excellent service. Clean",
  "Amazing service, very quick and reliable to fit the job in and complete it. Highly recommend this company for all your electrical needs. We have already booked in our next job",
  "Ashley completed the works in my kitchen to a good standard and at the price agreed. He also went the extra mile to put a new back box on one of my sockets which was not in good condition. Friendly and reliable service",
  "Ashley was very friendly and professional. His work was a very high standard. Definitely recommend to friends and family.",
  "Ashley was great - turned up on time, quickly diagnosed what the problem was and fixed it whilst there. Took a couple of hours but really professional job done. Gave some good advice re future electrical checking needed but didn’t try to upsell - genuinely felt like he was telling me for my own benefit, not his. Would definitely recommend for any electrical jobs needed.",
  "Ashley was great. Really clear about what was being done and where the cabling would be. Everything completed exactly as agreed and it all looks great.",
  "I would really recommend using Ashley. He communication was very good which is a breath of fresh air. The new light has been fitted and is working well. Wouldnt hesitate to us again. Friendly quick and efficient.",
  "Fantastically prompt. Within half an hour of requesting a quote, Ashley had been in touch to arrange a time to come a view the work that needed doing. Very honest and open about how he was going to approach it. He also offered some professional advice on other bits. Fantatsic will definitely use again for any further work.",
  "Communicative, friendly and work completed to a good standard.",
  "Very Good job , on time and very professional . He discussed the job in detail and showed us alternative ways of achieving our results. He advised us when he was turning off the mains with plenty of time to be prepared. He cleaned up and left us with a tidy job. He took a matter of a few hours and his price was very reasonable.",
  "Very pleased with the work done,professional,reliable electrician and very pleasant",
  "Ash came out to fix the electric fire. Came out really fast. Changed a plug socket and fixed other issues with the fire. Really friendly and professional. Highly recommend.",
  "Came on time, did the work quite and well, decent price.",
  "Cooker fitted professionally. A neat and tidy job. Reasonable price too. Ashley went out of his way to do the job on a Saturday morning which was much appreciated. Would recommend.",
  "Absolutely fantastic work carried out by Ashley. Very reliable and friendly, would highly recommend and definitely use again.",
  "Ashley replied quickly to our enquiry and came to our house to see the works we wanted. A quote was provided the same day and we agreed the price. We opted to provide the sockets, light fittings and switches and Ashley provided everything else e.G. All the cables and back boxes etc. We were kept informed with the progress of the works and we agreed on the positions of everything beforehand. All the sockets have been tested by Ashley and he showed this to us after fitting. This is a friendly and easy company to deal with and we would recommend it to others who are looking for similar works.",
  "I booked a visit for my parents and they were extremely happy with the service provided. Not only did the person replace the ceiling light, but they also helped with the odd jobs around the house that my parents were unable to complete themselves. A great person with a great heart.",
  "Would recommend",
  "Ashley was lovely and friendly. His quote matched the end price. He was very professional. He completed the job and I was really happy. If I need anything else doing he would be the 1st person I’d call",
  "Excellent service, very reasonable price highly recommend",
  "5 star! Excellent service. Very polite, understanding and helpful. Will definitely be recommending to all",
  "All work done to an excellent standard. Ashley was polite and very professional. Thank you!",
  "Had a bunch of work done by Ashley. New fuse box, outside plugs and lighting. He was really friendly, communicative, explained everything he was doing throughly and did the work to a high standard. We will absolutely be giving him a call next time we need anything electrical done.",
  "Ashley did an excellent job of fitting a light outside my front door, even though it was a bit problematic, due to my ineptitude on buying the correct light ??. Nevertheless he provided the switch that it needed, so I could turn it off. Real friendly guy. Left no mess. Recommend.",
  "Booked this chap to fit an electric cooker in my flat, turned up on time, was friendly, polite and professional. Completed the job and sent me invoice via email. Would recommended and use again.",
  "He was efficient, tidy and reliable. Came to do the job when he said he would. A really nice person. Thank you very much Ashley.",
  "As a first time buyer, Ash was very approachable, Friendly and professional. He came to view and discuss the job ahead and offered a whole range of ideas and knowledge. I can not thank Ash enough for his time and effort as the finished product and finer details are brilliant. I highly recommend Renegade Electrical LTD to anyone based in the Manchester region. Customer service 10/10 Affordability 10/10 Job satisfaction 10/10 Overall rating 10/10",
  "Would totally recommend Ash . Brilliant job in finding fault. Reasonably priced. Customer service next to none",
  "I'm over the moon with the service received through Checkatrade. The Electrician, Ashley, was prompt in picking up my request, we agreed a date and time. He was punctual, polite and helpful. His work was to a high standard, no mess, no fuss and advice on suitable lightbulbs. He asked questions I hadn't thought about, i.E. The \"drop\" from the ceiling (which is high) so that he could adjust the length of chain to suit MY needs. Very good value for a job well done. Will definitely recommend to friends and neighbours. Thank you CheckaTrade, will use again.",
  "He was efficient, friendly, reliable, turned up when he said he would",
  "All as expected, came when he said that he would and finished within the time frame",
  "I have used this company several times as I was impressed with his work and reliability Hevwent out of his way to assist my elderly father as well in an emergency!",
  "Definitely recommend, efficient, very friendly, clean and good value. Very happy with you service, thank you.",
  "Very pleased with Ashley and his work. The work was of very neat and of a high standard He arrived on time as promised and worked hard to get the job done and checked all was safe before he left, I will certainly use Ashley again",
  "Kind polite \r Well spoken\r Job completed earlier than expected\r Well recommend",
  "Very happy with the work undertaken, would recommend and use again",
  "Arrived on time, completed the tasks and a couple of additional things as well. Happy with the price and even fully cleaned up afterwards. Thanks again Ash",
  "Very satisfied with all the work very pleasant and helpful would definitely recommend and would use again",
  "Ashley made a good job of fitting the light and getting it working for me. Setting it up correctly. Very pleased.",
  "Ashley done a great job turned up on time\r And did a great tidy job and everything was great ????"
]
